{
  "id": "p-51",
  "number": 51,
  "title": "THE INNER GEMINI",
  "type": "zodiac-inner",
  "background": "#fff",
  "sections": [
    { "type": "heading", "level": 2, "content": "THE INNER GEMINI", "className": "text-xl font-semibold text-center mb-2" },
    { "type": "paragraph", "content": "Internally, Gemini individuals are complex and often misunderstood. They have a strong sense of curiosity and a desire to explore all that life has to offer. Geminis are thinkers and communicators, always processing information and seeking to share their discoveries with others. Despite their outgoing nature, they have a reflective side that seeks deeper understanding. Geminis crave variety and can often feel restless if bound to routine or monotony." },
    { "type": "heading", "level": 3, "content": "HOW OTHERS SEE GEMINI", "className": "font-semibold mt-4" },
    { "type": "paragraph", "content": "To others, Geminis appear as charming, witty, and sociable people who often are the life of the party. This is due to their ability to engage in small talk and adapt to any social setting. However, their changeable nature can sometimes be understood as inconsistency or indecisiveness. Geminis are known for their intellect and asking for advice, however, their ability to see both sides of every issue can make them seem unreliable." },
    { "type": "heading", "level": 3, "content": "HEALTH AND DIET", "className": "font-semibold mt-4" },
    { "type": "paragraph", "content": "Geminis should pay special attention to their respiratory system and mental well-being. Activities like yoga and meditation can help maintain their mental and physical health. A balanced diet rich in omega-3 fatty acids, found in fish and nuts, can support brain health, while antioxidants from fruits and vegetables protect against respiratory issues. Regular social interaction and intellectual challenges are also necessary for maintaining Geminis’ mental health." },
    { "type": "heading", "level": 3, "content": "LOVE AND RELATIONSHIPS", "className": "font-semibold mt-4" },
    { "type": "paragraph", "content": "Gemini, ruled by Mercury, brings a communicative and intellectual dynamic to relationships. They are drawn to partners who can match their wit and curiosity, craving mental stimulation as much as emotional connection. Geminis enjoy variety in their love life, seeking new experiences and learning opportunities within their relationships. They value freedom and space, fearing stagnation above all." },
    { "type": "heading", "level": 3, "content": "CAREER AND FINANCE", "className": "font-semibold mt-4" },
    { "type": "paragraph", "content": "Geminis’ versatility and love for variety often lead them to pursue multiple career paths or jobs that involve diverse skills and tasks. They are excellent communicators, which makes them fit for careers in marketing, public relations, or journalism. Financially, Geminis enjoy making money in unconventional ways but need to be wary of their tendency to make impulsive purchases. A balanced budget could help them manage their sometimes erratic earning patterns." },
    { "type": "heading", "level": 3, "content": "CELEBRITIES WITH GEMINI SUN", "className": "font-semibold mt-4" },
    { "type": "paragraph", "content": "Angelina Jolie (June 4), Kanye West (June 8), Johnny Depp (June 9), Natalie Portman (June 9), Marilyn Monroe (June 1), Paul McCartney (June 18), Nicole Kidman (June 20), Prince (June 7), Bob Dylan (May 24), Ian McKellen (May 25), Naomi Campbell (May 22), Helena Bonham Carter (May 26), Lauryn Hill (May 26), Octavia Spencer (May 25), Neil Patrick Harris (June 15)" }
  ]
}

